app/controllers/activities_controller.rb

SELECT * FROM `activities` WHERE (`activities`.`id` = 1)
SELECT * FROM `pd_users` WHERE (`pd_users`.`id` = 1001)
---
  def show

    @title_description = "Show Activity"
    @activity = Activity.find(params[:id])

#    @program_id = Program.find_by_sql ["SELECT * FROM programs where activity_id = ?",@id];
#   @category_id = Category.find_by_sql ["SELECT * FROM categories where activity_id = ?",@id]
#   @comment_id = ActivitiesComment.find_by_sql ["SELECT * FROM activities_comments where activity_id = ?",@id]
#   @programNames = []
#   @categoryNames = []
    @comments = @activity.activities_comments
    @new_comment = ActivitiesComment.new
#   for comment in @comment_id
#     @comments.push comment
#   end
#
#   for currentProgram in @program_id
#        @programNames.push currentProgram.program_name
#   end
#
#   for currentCategory in @category_id
#        @categoryNames.push currentCategory.category_name
#   end

    if (session[:pd_user_id])
        @pd_user = PdUser.find(session[:pd_user_id])

SELECT * FROM `activities` WHERE (`activities`.`id` = 1)
INSERT INTO `activities_comments` (`visible`, `activity_id`, `comment_text`, `email`) VALUES(0, '1', 'Comment 1', 'nipunb@stanford.edu')
---
  def save_activity_comment
    @activity_comment = ActivitiesComment.new(params[:new_comment])
    @id = params[:new_comment][:activity_id]
    @activity = Activity.find(@id)
#   @program_id = Program.find_by_sql ["SELECT * FROM programs where activity_id = ?",@id];
#   @category_id = Category.find_by_sql ["SELECT * FROM categories where activity_id = ?",@id]
#   @comment_id = ActivitiesComment.find_by_sql ["SELECT * FROM activities_comments where activity_id = ?",@id]
#   @programNames = []
#   @categoryNames = []
#   @comments = []
#   for comment in @comment_id
#     @comments.push comment
#   end
#
#   for currentProgram in @program_id
#        @programNames.push currentProgram.program_name
#   end
#
#   for currentCategory in @category_id
#        @categoryNames.push currentCategory.category_name
#   end
    respond_to do |format|
      if @activity_comment.save

INSERT INTO `activities_favorites` (`activitiy_id`, `Pduser_id`) VALUES('1', '1001')
---
  def addActivityAsFavorite
    @pdUser =  PdUser.find(session[:pd_user_id])
    activity = ActivitiesFavorite.find(:first, :conditions => { :pd_user_id => params[:Pduser_id], :activity_id => params[:activity_id]})
    if(activity == nil)  #if not found in database
      @favorite = ActivitiesFavorite.new(:pd_user_id =>params[:Pduser_id],:activity_id=>params[:activity_id])
      if @favorite.save

SELECT * FROM `pd_users` WHERE (`pd_users`.`id` = 1061)
---
  def new
    @title_description = "New Activity"
    if(session[:pd_user_id])
      @pdUser =  PdUser.find(session[:pd_user_id])

INSERT INTO `activities` (`name`, `visible`, `lon`, `category`, `updated_at`, `taggedAs`, `cost`, `comments`, `age_group`, `created_by`, `pd_user_id`, `resources`, `description`, `duration`, `instructions`, `otherPrograms`, `address`, `lat`, `created_at`) VALUES('test', 0, NULL, NULL, '2010-02-07 09:06:18', '', '', NULL, '', 'mfichman', NULL, '', '', '', '', NULL, '', NULL, '2010-02-07 09:06:18')
---
  def create
    @activity = Activity.new(params[:activity])
    @activity.makeTags


    respond_to do |format|
      if @activity.save

SELECT * FROM `activities` WHERE (`activities`.`id` = 1)
UPDATE `activities` SET `updated_at` = '2010-02-07 10:40:16', `name` = 'ACTIVITY' WHERE `id` = 1
---
  def update
    @activity = Activity.find(params[:id])


    respond_to do |format|
      if @activity.update_attributes(params[:activity])