app/controllers/community_controller.rb

SELECT * FROM `specs` WHERE (last_name like 'A%') ORDER BY last_name, first_name
---
  def index
    @title = "Community"
    @letters = "ABCDEFGHIJKLMNOPQRSTUVWXYZ".split("") # Create an array of strings,
                                                      # one for each letter of the alphabet
                                                      # %w(A B C D E F G H I J K L M N O P Q R S T U V W X Y Z)
                                                      # would work as well
    if (params[:id] != nil)
      @initial = params[:id]

      # Without pagination
      specs = Spec.find(:all,
                        :conditions => ["last_name like ?", @initial+'%'],
                        :order => "last_name, first_name")

SELECT * FROM `pd_users` WHERE (email = 'mokelo@cityofepa.org ')
SELECT * FROM `specs` WHERE (address = 'An address example' OR age_group = '8-10') ORDER BY last_name, first_name
---
  def browse
    @title = "Browse"

    # Trick: return if the form hasn't been submitted causing
    #        Rails to render the browse form immediately
    if (params[:commit] == nil)
      return
    end

    specs = Spec.find_by_fields(params)

    @pd_users = []
    @pd_users.concat(specs.collect { |spec|
                       spec.pd_user
                     }).uniq!