app/controllers/organizations_controller.rb

SELECT * FROM `organizations` WHERE (`organizations`.`id` = 1)
---
  def show
    @hDisplay = true
    @orgUser = true
    @id = params[:id]
    @organization = Organization.find(@id)

SELECT * FROM `organizations` WHERE (`organizations`.`id` = 1)
---
  def showOrg

    idOrg = params[:organization][:id]
    @organization = Organization.find(idOrg)

SELECT * FROM `organizations` WHERE (`organizations`.`id` = 1)
---
  def edit
    @hDisplay = true
    @orgUser = true
    @id = params[:id]
    @Neworganization = Organization.find(params[:id])

INSERT INTO `organizations` (`name`, `partners`, `visible`, `updated_at`, `contact`, `website`, `resources`, `description`, `asp`, `email`, `created_at`) VALUES('New Test Org', NULL, 0, '2009-06-04 01:05:26', 'New Test Org', 'website.org', 'This is where the resources go', 'This is where the description goes', NULL, 'orgemail@test.com', '2009-06-04 01:05:26')
UPDATE `users` SET `affiliateOrg` = 'New Test Org' WHERE `id` = 13
---
  def create
    @hDisplay = true
    @orgUser = true
    @Neworganization = Organization.new(params[:organization])
    @userC = session[:user]
    allorganizations = Organization.find(:all)
    @organizations = Hash.new

    for organization in allorganizations do
        if(organization.visible== true)
          @organizations.merge!({organization.name => organization.id})
        end
    end

    @organization = Organization.new
    1.times { @organization.partners.build }

    respond_to do |format|
      if @Neworganization.save
        flash[:notice] = 'Organization was successfully created.'
        @userC.update_attribute(:affiliateOrg,@Neworganization.name)
        @userC.update_attribute(:edit_perms,1)

INSERT INTO `emails` (`updated_at`, `from`, `to`, `mail`, `subject`, `created_at`) VALUES('2009-06-04 01:05:26', 'helpjgc@gmail.com', 'jgcstanford@gmail.com', 'A new Organization: New Test Org has been created by test.org .Kindly review and approve the organization', 'New organization has been created', '2009-06-04 01:05:26')
---
        email.to = to
        email.mail = mail
        email.subject = subject
        email.save