app/controllers/pd_user_controller.rb

INSERT INTO `pd_users` (`authorization_token`, `login_name`, `password`, `email`) VALUES(NULL, 'test', 'test', 'test@test.com')
INSERT INTO `emails` (`updated_at`, `from`, `to`, `mail`, `subject`, `created_at`) VALUES('2009-06-02 18:09:17', 'helpjgc@gmail.com', 'act@adm.com', 'A new Program Director: test has joined the network.Contact the new user at test@test.com', 'New Program Director has joined the network ', '2009-06-02 18:09:17')
---
  def register
    @title_description = "Register"
    @title = "Program Director Registration"

    if (param_posted?(:pd_user))
      @pd_user = PdUser.new(params[:pd_user])

      if @pd_user.save
        @pd_user.login!(session)
        flash[:notification] = "User #{@pd_user.login_name} registered successfully!"
        @activity_admin_user = User.find_by_sql ["SELECT * FROM users where activitesadmin = ?","1"];
        if @activity_admin_user[0].mailpref
          subject = "New Program Director has joined the network "
          to = @activity_admin_user[0].email
          from = 'helpjgc@gmail.com'
          mail = 'A new Program Director: '+ @pd_user.login_name + ' has joined the network.Contact the new user at '+ @pd_user.email
          email = Emails.new
          email.from = from
          email.to = to
          email.mail = mail
          email.subject = subject
          email.save

SELECT * FROM `pd_users` WHERE (`pd_users`.`login_name` = 'okelo' AND `pd_users`.`password` = 'test123') LIMIT 1
---
  def login
    @title_description = "Log in"
    @title = "Log in to Profile"

    if (request.get?)
      @pd_user = PdUser.new(:remember_me => remember_me_string)
    else
      if (param_posted?(:pd_user))
        @pd_user = PdUser.new(params[:pd_user])

        # Search in the registered users for the user based on its login name
        # and password
        pd_user = PdUser.find_by_login_name_and_password(@pd_user.login_name,
                                                         @pd_user.password)

SELECT * FROM `pd_users` WHERE (`pd_users`.`id` = 1060)
---
  def index

    @activities = Activity.find(:all)

    @title_description = "Profile"
    @title = "User Information"
    @pd_user = PdUser.find(session[:pd_user_id])

SELECT * FROM `pd_users` WHERE (`pd_users`.`id` = 1001)
SELECT * FROM `activities` WHERE (`activities`.`id` = 1)
---
  def pd_user_activities
    @title_description = "My Activities"
    @pd_user = PdUser.find(session[:pd_user_id])
    #@pd_user_activity = Activity.find_by_created_by(@pd_user.login_name)
    @pd_user_activity = Activity.find_by_sql ["SELECT * FROM activities where created_by = ?", @pd_user.login_name]
    @pd_user_favorite_activity = ActivitiesFavorite.find_by_sql ["SELECT * FROM activities_favorites where pd_user_id = ?", @pd_user.id]

    @allActivities = Activity.find(:all)