app/controllers/profile_controller.rb

  def show
    login_name = params[:login_name]
    @pd_user = PDUser.find_by_login_name(login_name)
---
SELECT * FROM `pd_users` WHERE (`pd_users`.`login_name` = 'ghose') LIMIT 1