app/controllers/professional_life_controller.rb

SELECT * FROM `pd_users` WHERE (`pd_users`.`id` = 1001)
---
  def edit
    @title = "Edit Professional Info"
    @pd_user = PdUser.find(session[:pd_user_id])