app/controllers/ratings_controller.rb

  def rate
    @activity = Activity.find(params[:id])
    if(session[:pd_user_id])
    @pd_user = PdUser.find(session[:pd_user_id])
    Rating.delete_all(["rateable_type = 'Activity' AND rateable_id = ? AND user_id = ?", @activity.id, @pd_user.id])
---
SELECT * FROM `activities` WHERE (`activities`.`id` = 1)
SELECT * FROM `pd_users` WHERE (`pd_users`.`id` = 1001)
DELETE FROM `ratings` WHERE (rateable_type = 'Activity' AND rateable_id = 1 AND user_id = 1001)