app/controllers/spec_controller.rb

  def edit
    @title = "Edit Additional Info"
    @pd_user = PDUser.find(session[:pd_user_id])

    # @pd_user.spec keeps its current value unless it's nil (i.e., keep current
    # spec if there is one). If it is nil, give it is nil create a new spec
    @pd_user.spec ||= Spec.new

    @spec = @pd_user.spec

    if (param_posted?(:spec))
      if (@pd_user.spec.update_attributes(params[:spec]))
---
SELECT * FROM `pd_users` WHERE (`pd_users`.`id` = 1001)
UPDATE `specs` SET `gender` = 'Male', `birthdate` = '2009-06-03', `occupation` = '' WHERE `id` = 415145853