app/controllers/user_controller.rb

    def RemoveASP
    @idOrg = params[:orgId]
    @row = params[:rowid]
    Asp.delete(@row)
---
DELETE FROM `asps` WHERE (`id` IN ('1'))

  def showAllActivities
    activityId = params[:activity][:id]
    @activity = Activity.find(activityId)
---
SELECT * FROM `activities` WHERE (`activities`.`id` = 1)

  def signup
    @hDisplay = true
    @orgUser = true
    @title_description = "JGC - Organizational User Signup"
    @user = User.new(params[:user])
    if request.post?
      if @user.save
---
INSERT INTO `users` (`salt`, `affiliateOrg`, `activitesadmin`, `hashed_password`, `admin`, `edit_perms`, `mailpref`, `login`, `email`, `created_at`) VALUES('oW4aCjbJsB', NULL, 0, '3fed02024d2b1e4dad8b1ad60c869404e41ec42b', 0, 0, 1, 'admin', 'ad@ad.com', '2009-06-02 18:07:59')

          email.to = to
          email.mail = mail
          email.subject = subject
          email.save
---
INSERT INTO `emails` (`updated_at`, `from`, `to`, `mail`, `subject`, `created_at`) VALUES('2009-06-02 18:08:42', 'helpjgc@gmail.com', 'ad@ad.com', 'A new User: acadmin has joined the network.Contact the new user at act@adm.com', 'New User has joined the network ', '2009-06-02 18:08:42')

  def welcomeOrgUser
    @hDisplay = true
    @orgUser = true
    @title_description = "JGC - Organizational User"
    @userC = session[:user]
    @organization = Organization.find_by_name(@userC.affiliateOrg)
---
SELECT * FROM `organizations` WHERE (`organizations`.`name` = 'Test organization') LIMIT 1

  def approveOrg
    idOrg = params[:id]
    @organization = Organization.find(idOrg)
    @organization.update_attribute(:visible,true)
---
SELECT * FROM `organizations` WHERE (`organizations`.`id` = 1)
UPDATE `organizations` SET `visible` = 1, `updated_at` = '2009-06-04 01:05:44' WHERE `id` = 1

 def delete_activity_comment
    @id = params[:activityId]
    @activity = Activity.find(@id)
    @commentId = params[:commentId]
    Activities_Comment.delete(@commentId)
---
SELECT * FROM `activities` WHERE (`activities`.`id` = 1)
DELETE FROM `activities_comments` WHERE (`id` IN ('2'))